import Image from 'next/image';
import React from 'react';

import styles from "@/components/template/BlogPage.module.css";

import a from "/public/blog/1a.webp";
import b from "/public/blog/2a.jpg";
import c from "/public/blog/3a.webp";
import d from "/public/blog/4a.jpg";



function BlogPage() {
    return (
        <div className={styles.container}>
            <div>
                <Image src={a} width={1400} height={700} alt='img' />
                <h3>مزایای مکمل‌ زینک در سلامتی و بدنسازی</h3>
                <p>
                    فهرست مطالب وقتی صحبت از تامین نیازهای تغذیه‌ای می‌شود، حتماً به میزان کافیِ زینک در برنامه غذایی خود توجه داشته باشید. اگرچه مصرف بیش از حد زینک سود زیادی برای شما نخواهد داشت، اما کمبود آن می‌تواند به مشکلاتی منجر شود؛ به خصوص که هر بار بدن شما عرق می‌کند، مقدار کمی زینک از دست</p>
            </div>
            <div>
            <Image src={b} width={1400} height={700} alt='img' />
                
                <h3>مکمل BCAA ( بی سی ای ای ) | مهمترین مزایا</h3>
                <p>فهرست مطالب مکمل BCAA یا آمینواسیدهای شاخه‌دار، شامل سه آمینواسید ضروری لوسین، ایزولوسین و والین است که به دلیل نقش‌های مهمی که در ساخت و ترمیم عضلات ایفا می‌کنند، به عنوان یکی از محبوب‌ترین مکمل‌ها در دنیای بدنسازی و ورزش‌های قدرتی شناخته می‌شود</p>
            </div>
            <div>
            <Image src={c} width={1400} height={700} alt='img' />
                
                <h3>مکمل HMB | اچ ام بی – 3 مزیت مهم</h3>
                <p>فهرست مطالب مکمل HMB یا بتا-هیدروکسی بتا-متیل ‌بوتیرات، ترکیب شیمیایی مشتق‌شده از آمینواسید لوسین است. این ماده به عنوان مکمل آنابولیک برای افزایش توده عضلانی و کاهش تجزیه پروتئین عضلانی استفاده می‌شود بسیاری از ورزشکاران و بدنسازان از این مکمل به منظور بهبود عملکرد ورزشی، افزایش قدرت بدنی و کاهش خستگی استفاده می‌کنند.</p>
            </div>
            <div>
            <Image src={d} width={1400} height={700} alt='img' />
                
                <h3>تفاوت‌های پروتئین وی و کازئین</h3>
                <p>پروتئین یکی از ضروری‌ترین مواد مغذی برای بدن است که به‌ویژه برای رشد و ترمیم بافت‌ها، ساخت آنزیم‌ها و هورمون‌ها، و حمایت از سیستم ایمنی نقش کلیدی دارد. ورزشکاران و افراد عادی به مصرف پروتئین برای حفظ سلامت عضلات و انجام فعالیت‌های روزمره نیاز دارند. اما انتخاب نوع پروتئین مناسب بسته به نیازهای فرد می‌تواند</p>
            </div>
        </div>
    )
}

export default BlogPage