import creatin from "/public/banner/creatin.webp";
import food from "/public/banner/food.webp";
import gym from "/public/banner/gym.webp";
import sale from "/public/banner/sale.webp";
import whey from "/public/banner/whey.webp";
import yalda from "/public/banner/yalda.webp";

const banner = [
    {
        id: "1",
        image: creatin,
        title: "کراتین مونوهیدرات |Creatin bpi",
        price: "1150",
        subject: "کراتین مونوهیدرات شرکت bpi از نوع میکرونایذ است که با حلالیت بالا باعث بازسازی سریع ذخایر انرژی ATP و همین موضوع می‌تواند روند رشد عضلانی و همینطور افزایش قدرت عضلانی را افزایش دهد.",
        consumption: "بارگیری: برخی متخصصان ورزشی معتقد هستن بارگیری کراتین تاثیرات این مکمل چند برابر می‌کند، بارگیری بدین صورت است که در هفته اول روزانه ۲۰ گرم کراتین در وعده‌های صبح، قبل تمرین، بعد از تمرین و قبل از خواب مصرف شود.مصرف کراتین پس از بارگیری در روزهای تمرین به میزان ۵ الی ۱۰ گرم در وعده‌های قبل و بعد از تمرین، می‌تواند باعث رشد عضلانی و افزایش قدرت شما شود.",
        
    },
    {
        id: "2",
        image: whey,
        title: "پروتیین وی",
        price: "1150",
        subject: "کراتین مونوهیدرات شرکت bpi از نوع میکرونایذ است که با حلالیت بالا باعث بازسازی سریع ذخایر انرژی ATP و همین موضوع می‌تواند روند رشد عضلانی و همینطور افزایش قدرت عضلانی را افزایش دهد.",
        consumption: "بارگیری: برخی متخصصان ورزشی معتقد هستن بارگیری کراتین تاثیرات این مکمل چند برابر می‌کند، بارگیری بدین صورت است که در هفته اول روزانه ۲۰ گرم کراتین در وعده‌های صبح، قبل تمرین، بعد از تمرین و قبل از خواب مصرف شود.مصرف کراتین پس از بارگیری در روزهای تمرین به میزان ۵ الی ۱۰ گرم در وعده‌های قبل و بعد از تمرین، می‌تواند باعث رشد عضلانی و افزایش قدرت شما شود.",
        
    },
    // {
    //     id: "3",
    //     image:  food ,
    // }, 
    {
        id: "4",
        image:  gym ,
    }, 
    // {
    //     id: "5",
    //     image: sale ,
    // },
    // {
    //     id: "6",
    //     image:  yalda ,
    // },
]

export default banner;